Revit 2027 API
ExternalResourceMatchOptions Constructor
 Constructs new instance with specified resource type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceMatchOptions(
	ExternalResourceType resourceType
)
Public Sub New (
	resourceType As ExternalResourceType
)
public:
ExternalResourceMatchOptions(
	ExternalResourceType^ resourceType
)
new :
        resourceType : ExternalResourceType -> ExternalResourceMatchOptions
Parameters
resourceType ExternalResourceType
 The desired resource type.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalResourceMatchOptions Class
Autodesk.Revit.DB Namespace